Revit 2024 API
Marble Class
 A static class that provides access to the property names that appear in the Marble visual asset schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static class Marble
Visual Basic
Public NotInheritable Class Marble
Visual C++
public ref class Marble abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Marble
See Also
Marble Members
Autodesk.Revit.DB.Visual Namespace